/*
Review

1. 포인터 (일종의 자료형이라 생각하자) 

	예시 ->  
			int = 정수 
			int * = int 변수의 주소

	사용처 -> 	1. 동적할당 
				2. main()함수의 변수에 직접적인 영향을 주고 싶을때 (swap함수 예제 참고) 
				3. 어떤 함수가 return 값이 2개이상이어야 할 때 
				4. 배열을 함수의 인자로 전달할때

2. 구조체 (자료형을 정의하고싶을 때) 객체와 개념 비슷 
	
	사용처 -> 	1. 자료형을 새로 정의할때 사용한다! 


3. Node와 연결리스트 (완전히 동적인 자료형?)
	
	장점 -> 삽입, 삭제가 용이하다! (배열 보다)

4. Stack / Queue : FILO / FIFO
	개념 중요!!!
	
5. 정렬 알고리즘
	
	종류 -> 	1. 버블
				2. 삽입
				3. 선택***
				4. 퀵***

6. 트리 (이진트리) -> 사이클이 생기면 (그래프)
 
 
*/
